In [ ]:
#pandas library
#useful for data manipulation
#used for only structured data

In [4]:
import pandas as pd

In [5]:
data=pd.read_csv(r"C:\Users\Chaitanya\OneDrive\Desktop\NTIN SIR\traffic.csv",sep='$')

In [6]:
data

    nitin  45  m  34000   delhi
0    neha  65  f  76000  mumbai
1    aman  75  m  44000   delhi
2    ravi  47  m  77000    pune
3  vishal  91  m  87000   delhi
4  shruti  54  f  27000   delhi
5   sneha  75  f  19000    pune
6    amit  84  m  75000    pune
7  deepak  38  m  58000    pune
8   rajan  84  m  65000  mumbai
9  shweta  59  f  82000  mumbai

In [8]:
data.shape

(10, 5)

In [9]:
cols=['Names','Age','Gender','Salary','City']
data=pd.read_csv(r"C:\Users\Chaitanya\OneDrive\Desktop\NTIN SIR\traffic.csv",sep='$',names=cols)

In [10]:
data

     Names  Age Gender  Salary    City
0    nitin   45      m   34000   delhi
1     neha   65      f   76000  mumbai
2     aman   75      m   44000   delhi
3     ravi   47      m   77000    pune
4   vishal   91      m   87000   delhi
5   shruti   54      f   27000   delhi
6    sneha   75      f   19000    pune
7     amit   84      m   75000    pune
8   deepak   38      m   58000    pune
9    rajan   84      m   65000  mumbai
10  shweta   59      f   82000  mumbai

In [11]:
data.shape[0]

11

In [12]:
data.shape[1]

5

In [14]:
data.columns

Index(['Names', 'Age', 'Gender', 'Salary', 'City'], dtype='object')

In [18]:
data.head()

    Names  Age Gender  Salary    City
0   nitin   45      m   34000   delhi
1    neha   65      f   76000  mumbai
2    aman   75      m   44000   delhi
3    ravi   47      m   77000    pune
4  vishal   91      m   87000   delhi

In [19]:
data.tail()

     Names  Age Gender  Salary    City
6    sneha   75      f   19000    pune
7     amit   84      m   75000    pune
8   deepak   38      m   58000    pune
9    rajan   84      m   65000  mumbai
10  shweta   59      f   82000  mumbai

In [20]:
data.columns

Index(['Names', 'Age', 'Gender', 'Salary', 'City'], dtype='object')

In [22]:
data['Salary']

0     34000
1     76000
2     44000
3     77000
4     87000
5     27000
6     19000
7     75000
8     58000
9     65000
10    82000
Name: Salary, dtype: int64